Thesis_UMAINE_RegularWave_U12p47/constant/probeDefinitions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      loggingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceElevationAnyName
{
    type waveGauge;

    pointDistribution lineDistribution;
    N 1;
    linestart (0 99 -20);
    lineend   (100 99 -20);
    add       ( 0 0 50);
    axis      z;
    stretch 1.0;

    // REQURIED ONLY FOR NEW FUNCTIONOBJECT IMPLEMENTATION
    writeControl adjustableRunTime;
    writeInterval 0.5;
}


// ************************************************************************* //
