Thesis_UMAINE_RegularWave_U12p47/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            0;

relaxationNames     ( inlet outlet );

initializationName  inlet;

externalForcing     oceanWave3D;

externalForcingCoeffs
{
    waveType            oceanWave3D;

    nIntervals          1;
    startTimes          nonuniform List<scalar>
    1
    (
        0
    );
    endTimes            nonuniform List<scalar>
    1
    (
        700
    );

    rampInterval        on;
    Tsoft               10;

    mappingZone         inlet;
    translateOpenFoamMesh ( 750 122 0 );
}

inletCoeffs
{
    waveType            externalSource;

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        relaxType           INLET;
        startX              ( -200 -110 0 );
        endX                ( -100 110 0 );
        orientation         ( 1 0 0 );
    }
}

outletCoeffs
{
    waveType            externalSource;

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        relaxType           OUTLET;
        startX              ( 100 -110 0 );
        endX                ( 200 110 0 );
        orientation         ( 1 0 0 );
    }
}



// ************************************************************************* //
