Thesis_UMAINE_RegularWave_U12p47/system/blockMeshDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-200 -100 -200)
    (200 -100 -200)
    (200  100 -200)
    (-200  100 -200)
    (-200 -100 184)
    (200 -100 184)
    (200  100 184)
    (-200  100 184)


);

blocks          
(
   hex (0 1 2 3 4 5 6 7) (51 25 48) simpleGrading (1 1 1)

);

edges           
(
);

patches         
(
    patch inlet
    (
         (0 4 7 3)
    )
    wall bottom 
    (
        (0 3 2 1)
    )
    patch outlet
    (
       (2 6 5 1)
    )

    patch atmosphere 
    (
        (4 5 6 7)
    )
    
    wall front
    (
         (3 7 6 2)

    )
    wall back
    (

         (1 5 4 0)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
