Thesis_UMAINE_RegularWave_U12p47/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            (fvMotionSolvers libmyTurbinesFoam );

application interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime        750;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   1.0;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  yes;

//maxCo          0.00001;
maxCo          5.0;
maxAlphaCo     2.0;

maxDeltaT       1.0;


functions
{
    #includeIfPresent "../waveGaugesNProbes/surfaceElevationAnyName_controlDict";
}

// ************************************************************************* //
