Thesis_UMAINE_RegularWave_U12p47/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    UMaineVolturn_squareSupport.stl
    {
        type    triSurfaceMesh;
        name    floatingObject ;
        
    }
    refine
    {
        type    box;
        min	( -1000 -800 -8); // Orignal Y = - 80
 	max     (1500  800 8);
    }

    refineRelaxation
    {
        type    box;
        min	( -1000 -800 -50);
 	max     (1500  800 20);
    }
    turbine
    {
        type searchableCylinder;
        point1 ( -40 0 90);
        point2 (20 0 90);
        radius 79;
    }
    
};

castellatedMeshControls
{
    maxLocalCells   200000000;
    maxGlobalCells  300000000;
    minRefinementCells 20;
    nCellsBetweenLevels 5;
    maxLoadUnbalance 0.1;
    allowFreeStandingZoneFaces true;
    resolveFeatureAngle     30;
    features
    (

      {
            file "UMaineVolturn_squareSupport.eMesh" ;
            level 4 ;
        }    
 	
    );

    refinementSurfaces
    {
        
         floatingObject
        {
            level (4 4);
            
        }
    }

    refinementRegions
    {
	refine
	{
		mode 	inside;
		levels (( 1 1 )) ;
        }      
        refineRelaxation
	{
		mode 	inside;
		levels (( 1 1 )) ;
        }        
        turbine
        {
            mode        inside;
            levels      ((1e15 1));
        }
        floatingObject
	{
		mode distance;
		levels ((1.5 4) ); //(level 1) (level 2) (level 3)
	}   
    }

    locationInMesh ( 180.93 30.88143855 0.86520574 ) ;
}

snapControls
{
    tolerance       1;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
    detectNearSurfacesSnap true;
    nSmoothPatch    5;
    nSolveIter      50;
    nRelaxIter      5;
    nFeatureSnapIter 10;
    nSmoothInternal 3;
    nFaceSplitInterval 5;
}

addLayersControls
{
    layers
    {
        floatingObject
        {
            nSurfaceLayers 3;
        }
    }
    relativeSizes    true ;
    expansionRatio    1.1 ;
    firstLayerThickness   0.7 ;
    featureAngle    30;
    slipFeatureAngle 30;
    nGrow           0;
    nBufferCellsNoExtrude 0;
    minMedialAxisAngle 90;
    maxFaceThicknessRatio 0.2;
    maxThicknessToMedialRatio 0.3;
    minThickness    0.1;
    nLayerIter      75;
    nRelaxIter      7;
    nSmoothSurfaceNormals 10;
    nSmoothNormals  3;
    nSmoothThickness 10;
    nRelaxedIter    10;
    nMedialAxisIter 10;
}

meshQualityControls
{
    minVol          1e-20;
    minTetQuality   1e-20;
    minArea         1e-20;
    minTwist        0.05;
    minDeterminant  1e-06;
    minFaceWeight   0.02;
    minVolRatio     0.01;
    minTriangleTwist -1;
    minFlatness     0.5;
    maxNonOrtho     70;
    maxBoundarySkewness 5;
    maxInternalSkewness 4;
    maxConcave      80;
    nSmoothScale    4;
    errorReduction  0.75;

    relaxed
    {
        minVol          1e-30;
        minTetQuality   1e-30;
        minArea         1e-30;
        minTwist        0.001;
        minDeterminant  1e-06;
        minFaceWeight   1e-06;
        minVolRatio     0.01;
        minTriangleTwist -1;
        minFlatness     0.5;
        maxNonOrtho     75;
        maxBoundarySkewness 10;
        maxInternalSkewness 8;
        maxConcave      80;
        nSmoothScale    4;
        errorReduction  0.75;
    }
}

mergeTolerance  1e-06;

debug           0;


// ************************************************************************* //
